public class Main {
    public static void main(String[] args) {
        // Задание 1.
        System.out.println("Вася");
        System.out.println("    пошел");
        System.out.println("        гулять");
        System.out.println("---------------------------------------");

        // Задание 2.
        System.out.println("    $");
        System.out.println("   $$$");
        System.out.println("  $$$$$");
        System.out.println(" $$$$$$$");
        System.out.println("  HH HH");
        System.out.println("  ZZZZZ");

        // Домашнее задание - 1) Научиться вводить в строку, 2) Переменные в Java, 3) Хоткеи для IntelliJIdea и Windows, 4) Вызов командной строки
        // Ресурсы для изучения Java - Метанит
    }
}